Revit 2026 API

# SpacingRuleDistance Property

---

The exact distance between layout lines.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Distance { get; set; }
```
```vb
Public Property Distance As Double
	Get
	Set
```
```cpp
public:
property double Distance {
	double get ();
	void set (double value);
}
```
```fsharp
member Distance : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the Layout property is None or FixedNumber. |

This property is only available when Layout is equal to FixedDistance, MaximumSpacing, or MinimumSpacing. Must be a positive value less than 30000'.

#### Reference

SpacingRule Class

Autodesk.Revit.DB Namespace